app/views/pages/profile.html.erb

                  <div class="col-sm-11">
                       <p class="post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span><span class="post-creation"> - <%= @p.created_at.to_formatted_s(:time) %></p></span>
---
SELECT "posts".* FROM "posts" WHERE (user_id = 6) ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

     <div class ="col-xs-3">
                 <%= render '/components/follow_button', :user => User.find_by_username(params[:id]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Satel"], ["LIMIT", 1]]