app/views/pages/profile.html.erb


   <%= render '/components/follow_button', :user => User.find_by_username(params[:id]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Satel"], ["LIMIT", 1]]