app/controllers/pages_controller.rb

  def home
        @posts = Post.all
       @newPost = Post.new

        @toFollow = User.all.last(5)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 5]]

  def profile


    #grab the username

    if(User.find_by_username(params[:id]))
    @username = params[:id]
  else
     redirect_to root_path, :notice=> "User not Found!"
  end

    @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id) # only current user's posts
    @newPost = Post.new

     @toFollow = User.all.last(5)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Ruben"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 4) ORDER BY "posts"."created_at" DESC
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 5]]

  def explore
        @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC