app/controllers/posts_controller.rb

    def create

    @post = Post.new(post_params)
     @post.user_id = current_user.id
      respond_to do |f|
          if(@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "no"], ["user_id", 5], ["created_at", "2018-09-11 10:26:00.250478"], ["updated_at", "2018-09-11 10:26:00.250478"]]