app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def create
        user = User.find(params[:followed_id])

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def destroy
        user = Relationship.find(params[:id]).followed