app/models/user.rb

         def follow(other)
           active_relationships.create(followed_id: other.id)
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 5], ["followed_id", 3], ["created_at", "2018-09-17 11:01:57.171775"], ["updated_at", "2018-09-17 11:01:57.171775"]]

          def unfollow(other)
            active_relationships.find_by(followed_id: other.id).destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 3]]