app/views/layouts/application.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Ruben"], ["LIMIT", 1]]
---
             <div class="col-sm-2" style="font-size: 100%; opacity: 0.7;">Posts<br>
                    <h6 style="color: #0084B4; font-size: 100%;"><%= User.find_by_username(params[:id]).posts.count %></h6></div>
            <div class="col-sm-2" style="font-size: 100%; opacity: 0.7;">Followers<br>
                    <h6 style="color: #0084B4; font-size: 100%;"><%= User.find_by_username(params[:id]).followers.count %></h6></div>